Revit 2027 API
RenderingImageExposureSettings.ExposureValue Property
 The value of rendering image exposure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ExposureValue { get; set; }
Public Property ExposureValue As Double
	Get
	Set
public:
property double ExposureValue {
	double get ();
	void set (double value);
}
member ExposureValue : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The value of rendering image exposure is not valid. The valid range is 0 to 21.
Remarks
 Default exposure value based on Lighting Scheme.
See Also
Reference
RenderingImageExposureSettings Class
Autodesk.Revit.DB Namespace